#+TITLE: Guia Ejercicios - Memoria Virtual + Segmentación
#+STARTUP: inlineimages
*** Punto 1 - Algoritmo FIFO
    El algoritmo *FIFO* elige como víctima a la página que está hace más tiempo está en memoria
    
    |------------------------+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-------|
    | Sec. Paginas           |   0 |   1 |   7 |   2 |   3 |   2 |   7 |   1 |   0 |   3 |   0 |   2 |   3 |   1 | TOTAL |
    |------------------------+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-------|
    | Frame 1                | ->0 | ->0 | ->0 | ->0 | ~3~ |   3 |   3 |   3 |   3 |   3 |   3 |   3 |   3 |   3 |       |
    | Frame 2                |     |   1 |   1 |   1 | ->1 | ->1 | ->1 | ->1 | ~0~ |   0 |   0 |   0 |   0 |   0 |       |
    | Frame 3                |     |     |   7 |   7 |   7 |   7 |   7 |   7 | ->7 | ->7 | ->7 | ->7 | ->7 | ~1~ |       |
    | Frame 4                |     |     |     |   2 |   2 |   2 |   2 |   2 |   2 |   2 |   2 |   2 |   2 |   2 |       |
    |------------------------+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-------|
    | Page Fault             |   1 |   1 |   1 |   1 |   1 |   0 |   0 |   0 |   1 |   0 |   0 |   0 |   0 |   1 |     7 |
    |------------------------+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-------|
    | Acceso a Disco         |   1 |   1 |   1 |   1 |   1 |   0 |   0 |   0 |   1 |   0 |   0 |   0 |   0 |   1 |     7 |
    |------------------------+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-------|
    | Operación de Lectura   | p=0 | p=1 | p=7 | p=2 | p=3 |     |     |     | p=0 |     |     |     |     | p=1 |       |
    | Operación de Escritura |     |     |     |     |     |     |     |     |     |     |     |     |     |     |       |
    |------------------------+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-----+-------|
    #+TBLFM: @6$16=vsum($2..$15)::@7$16=vsum($2..$15)
*** Punto 1 - Algoritmo Optimo
    El algoritmo *Optimo* elige como víctima a la página que accederemos más lejos en el futuro
    
    |------------------------+-----+-----+-----+-----+-----+---+---+---+-----+---+---+---+---+---+-------|
    | Sec. Paginas           |   0 |   1 |   7 |   2 |   3 | 2 | 7 | 1 |   0 | 3 | 0 | 2 | 3 | 1 | TOTAL |
    |------------------------+-----+-----+-----+-----+-----+---+---+---+-----+---+---+---+---+---+-------|
    | Frame 1                |   0 |   0 |   0 |   0 | ~3~ | 3 | 3 | 3 |   3 | 3 | 3 | 3 | 3 | 3 |       |
    | Frame 2                |     |   1 |   1 |   1 |   1 | 1 | 1 | 1 |   1 | 1 | 1 | 1 | 1 | 1 |       |
    | Frame 3                |     |     |   7 |   7 |   7 | 7 | 7 | 7 | ~0~ | 0 | 0 | 0 | 0 | 0 |       |
    | Frame 4                |     |     |     |   2 |   2 | 2 | 2 | 2 |   2 | 2 | 2 | 2 | 2 | 2 |       |
    |------------------------+-----+-----+-----+-----+-----+---+---+---+-----+---+---+---+---+---+-------|
    | Page Fault             |   1 |   1 |   1 |   1 |   1 | 0 | 0 | 0 |   1 | 0 | 0 | 0 | 0 | 0 |     6 |
    |                        |     |     |     |     |     |   |   |   |     |   |   |   |   |   |       |
    |------------------------+-----+-----+-----+-----+-----+---+---+---+-----+---+---+---+---+---+-------|
    | Acceso a Disco         |   1 |   1 |   1 |   1 |   1 | 0 | 0 | 0 |   1 | 0 | 0 | 0 | 0 | 0 |     6 |
    |------------------------+-----+-----+-----+-----+-----+---+---+---+-----+---+---+---+---+---+-------|
    | Operación de Lectura   | p=0 | p=1 | p=7 | p=2 | p=3 |   |   |   | p=0 |   |   |   |   |   |       |
    | Operación de Escritura |     |     |     |     |     |   |   |   |     |   |   |   |   |   |       |
    |------------------------+-----+-----+-----+-----+-----+---+---+---+-----+---+---+---+---+---+-------|
    #+TBLFM: @6$16=vsum($2..$15)::@8$16=vsum($2..$15)
*** Punto 1 - Algoritmo LRU
    El algoritmo *LRU* elige como víctima a la página a la página que hace más tiempo no se referencia/accede (igual que FIFO)
    
    |------------------------+-----+-----+-----+-----+-----+---+---+---+-----+---+---+---+---+-----+-------|
    | Sec. Paginas           |   0 |   1 |   7 |   2 |   3 | 2 | 7 | 1 |   0 | 3 | 0 | 2 | 3 |   1 | TOTAL |
    |------------------------+-----+-----+-----+-----+-----+---+---+---+-----+---+---+---+---+-----+-------|
    | Frame 1                |   0 |   0 |   0 |   0 | ~3~ | 3 | 3 | 3 |   3 | 3 | 3 | 3 | 3 |   3 |       |
    | Frame 2                |     |   1 |   1 |   1 |   1 | 1 | 1 | 1 | ~0~ | 0 | 0 | 0 | 0 |   0 |       |
    | Frame 3                |     |     |   7 |   7 |   7 | 7 | 7 | 7 |   7 | 7 | 7 | 7 | 7 | ~1~ |       |
    | Frame 4                |     |     |     |   2 |   2 | 2 | 2 | 2 |   2 | 2 | 2 | 2 | 2 |   2 |       |
    |------------------------+-----+-----+-----+-----+-----+---+---+---+-----+---+---+---+---+-----+-------|
    | Page Fault             |   1 |   1 |   1 |   1 |   1 | 0 | 0 | 0 |   1 | 0 | 0 | 0 | 0 |   1 |     7 |
    |------------------------+-----+-----+-----+-----+-----+---+---+---+-----+---+---+---+---+-----+-------|
    | Acceso a Disco         |   1 |   1 |   1 |   1 |   1 | 0 | 0 | 0 |   1 | 0 | 0 | 0 | 0 |   1 |     7 |
    |------------------------+-----+-----+-----+-----+-----+---+---+---+-----+---+---+---+---+-----+-------|
    | Operación de Lectura   | p=0 | p=1 | p=7 | p=2 | p=3 |   |   |   | p=0 |   |   |   |   | p=1 |       |
    | Operación de Escritura |     |     |     |     |     |   |   |   |     |   |   |   |   |     |       |
    |------------------------+-----+-----+-----+-----+-----+---+---+---+-----+---+---+---+---+-----+-------|
    #+TBLFM: @6$16=vsum($2..$15)::@7$16=vsum($2..$15)
*** Punto 1 - Algoritmo Clock
    - El algoritmo de *clock* elige como víctima por prioridad según si el *BIT de uso* es ~u=0~
    - Si se accede a una página que ya estaba en memoria se habilita el *BIT de uso* a ~u=1~ (suponiendo que estaba deshabilitado)
    
    |------------------------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
    | Sec. Paginas           |     0 |     1 |     7 |     2 |     3 |     2 |     7 |     1 |     0 |     3 |     0 |     2 |     3 |     1 | TOTAL |
    |------------------------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
    | Frame 1                | ->0^1 | ->0^1 | ->0^1 | ->0^1 | ~3^1~ |   3^1 |   3^1 |   3^1 |   3^1 |   3^1 |   3^1 |   3^1 |   3^1 |   3^1 |       |
    | Frame 2                |       |   1^1 |   1^1 |   1^1 | ->1^0 | ->1^0 | ->1^0 | ->1^1 | ~0^1~ |   0^1 |   0^1 |   0^1 |   0^1 |   0^1 |       |
    | Frame 3                |       |       |   7^1 |   7^1 |   7^0 |   7^0 |   7^1 |   7^1 | ->7^1 | ->7^1 | ->7^1 | ->7^1 | ->7^1 | ~1^1~ |       |
    | Frame 4                |       |       |       |   2^1 |   2^0 |   2^1 |   2^0 |   2^1 |   2^1 |   2^1 |   2^1 |   2^1 |   2^1 | ->2^1 |       |
    |------------------------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
    | Page Fault             |     1 |     1 |     1 |     1 |     1 |     0 |     0 |     0 |     1 |     0 |     0 |     0 |     0 |     1 |     7 |
    |------------------------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
    | Acceso a Disco         |     1 |     1 |     1 |     1 |     1 |     0 |     0 |     0 |     1 |     0 |     0 |     0 |     0 |     1 |     7 |
    |------------------------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
    | Operación de Lectura   |   p=0 |   p=1 |   p=7 |   p=2 |   p=3 |       |       |       |   p=0 |       |       |       |       |   p=1 |       |
    | Operación de Escritura |       |       |       |       |       |       |       |       |       |       |       |       |       |       |       |
    |------------------------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------+-------|
    #+TBLFM: @6$16=vsum($2..$15)::@7$16=vsum($2..$15)
*** Punto 1 - Algoritmo LRU
    |---------------------+-------+---------------------------+----+------------+------------------------|
    | Puntero (si aplica) | Marco | Página (Numerada desde 0) | Us | Modificado | Instante de referencia |
    |---------------------+-------+---------------------------+----+------------+------------------------|
    |                     |     1 |                        14 |  1 |          1 |                     28 |
    |                     |     3 |                        17 |  1 |          0 |                      3 |
    |                     |     5 |                        19 |  1 |          1 |                     15 |
    | -->                 |     8 |                        -- |  - |         -- |                     -- |
    |---------------------+-------+---------------------------+----+------------+------------------------|

    Las páginas {17,19,14} son las dadas en la tabla extra, las agregamos para que sea más cómodo
    *asumimos que si se accede a una dirección inválida termina la ejecución del proceso*
    
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    | Sec. Paginas           | 17(L) | 19(E) | 14(E) | 0(L) | 15(E) | 12(L) | 17(E) | 15(L) | 19(E) | 21(L) | TOTAL |
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    | Frame 1                |       |       |       |   14 |    14 |    14 |  ~17~ |    17 |    17 |       |       |
    | Frame 3                |       |       |       |   17 |  ~15~ |    15 |    15 |    15 |    15 |       |       |
    | Frame 5                |       |       |       |   19 |    19 |  ~12~ |    12 |    12 |    12 |       |       |
    | Frame 8                |       |       |       |  ~0~ |     0 |     0 |     0 |     0 |  ~19~ |       |       |
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    | Page Fault             |       |       |       |    1 |     1 |     1 |     1 |     0 |     1 | PF    |     4 |
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    | Acceso a Disco         |       |       |       |    1 |     1 |     2 |     2 |     0 |     1 |       |     6 |
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    | Operación de Lectura   |       |       |       |  p=0 |  p=15 |  p=12 |  p=17 |       |  p=19 |       |       |
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    | Operación de Escritura |       |       |       |      |       |  p=19 |  p=14 |       |       |       |       |
    |------------------------+-------+-------+-------+------+-------+-------+-------+-------+-------+-------+-------|
    #+TBLFM: @6$12=vsum($5..$9)::@7$12=vsum($5..$9)

    #+BEGIN_QUOTE
    en la pagina 21 va a fallar, porque no es numero_pagina válida, sólo son válidas de la 0 a la 19

    en la posicion=2 de la sec. de paginas, reemplaza la pagina 17 por 15, 
    porque la pag.17 es la que hace mas tiempo está, es la menos reciente utilizada en el pasado (instante de ultima referencia que es 3)
    las otras son mas recientes porque su valor es 15,28
    
    lo mismo en la posicion=3, cuando reemplaza la 19 por la 12, la menos reciente utilizada era la 19 (instante=15)
    podrias verlo en la tabla como que estaba en el pasado (la 15 y 0 no podian porque eran muy recientes)
    #+END_QUOTE
*** Punto 1 - Algoritmo Clock Modificado
    |---------------------+-------+---------------------------+---------+----------------+------------------------|
    | Puntero (si aplica) | Marco | Página (Numerada desde 0) | BIT Uso | BIT Modificado | Instante de referencia |
    |---------------------+-------+---------------------------+---------+----------------+------------------------|
    |                     |     1 |                        14 |       1 |              1 |                     28 |
    |                     |     3 |                        17 |       1 |              0 |                      3 |
    |                     |     5 |                        19 |       1 |              1 |                     15 |
    | -->                 |     8 |                        -- |       - |             -- |                     -- |
    |---------------------+-------+---------------------------+---------+----------------+------------------------|

    Las páginas {17,19,14} son las dadas en la tabla extra, las agregamos para que sea más cómodo
    *asumimos que si se accede a una dirección inválida termina la ejecución del proceso*
    
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    | Sec. Paginas           | 17(L) | 19(E) | 14(E) | 0(L)       | 15(E)      | 12(L)      | 17(E)      | 15(L)      | 19(E)      | 21(L) | TOTAL |
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    | Frame 1                |       |       |       | ->14^(1,1) | 14^(0,1)   | ->14^(0,1) | ~17^(1,1)~ | 17^(1,1)   | 17^(1,1)   |       |       |
    | Frame 3                |       |       |       | 17^(1,0)   | ~15^(1,1)~ | 15^(0,1)   | ->15^(0,1) | ->15^(1,1) | ->15^(1,1) |       |       |
    | Frame 5                |       |       |       | 19^(1,1)   | ->19^(0,1) | 19^(0,1)   | 19^(0,1)   | 19^(0,1)   | 19^(1,1)   |       |       |
    | Frame 8                |       |       |       | ~0^(1,0)~  | 0^(0,0)    | ~12^(1,0)~ | 12^(1,0)   | 12^(1,0)   | 12^(1,0)   |       |       |
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    | Page Fault             |       |       |       | 1          | 1          | 1          | 1          | 0          | 0          |     1 |     4 |
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    | Acceso a Disco         |       |       |       | 1          | 1          | 1          | 2          | 0          | 0          |       |     5 |
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    | Operación de Lectura   |       |       |       | p=0        | p=15       | p=12       | p=17       |            |            |       |       |
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    | Operación de Escritura |       |       |       |            |            |            | p=14       |            |            |       |       |
    |------------------------+-------+-------+-------+------------+------------+------------+------------+------------+------------+-------+-------|
    #+TBLFM: @6$12=vsum($5..$9)::@7$12=vsum($5..$9)
    
    Entre la posicion=4,5 de la secuencia de páginas el algoritmo de clock modificado hará
    - 1ra vuelta: modificará los bit de uso en u=0, quedando en este orden 14^(0,1),   17^(0,0),   19^(0, 1)
    - 2da vuelta: va a buscar por prioridad en este orden (u=0,m=0), (u=0, m=1), (u=1, m=1)
    - 3ra vueta: algoritmo sustituye la pagina 17 por la 15 porque tiene (u=0, m=0), y mueve el puntero al siguiente frame

    |------------+------------+------------+------------|
    |            | 1ra vuelta | 2da vuelta | 3ra vuelta |
    |------------+------------+------------+------------|
    | ->14^(1,1) | 14^(0,1)   | 14^(0,1)   | 14^(0,1)   |
    | 17^(1,0)   | 17^(0,0)   | ->17^(0,0) | ~15^(1,1)~ |
    | 19^(1,1)   | 19^(0,0)   | 19^(0,1)   | ->19^(0,1) |
    | 0^(1,0)    | ->0^(0,0)  | 0^(0,0)    | 0^(0,0)    |
    |------------+------------+------------+------------|
*** Punto A - Proceso 1
    - La Tabla de Paginas (TP) de cada proceso usa el *algoritmo de sustitución LRU*
    - La TLB usa el *algoritmo de sustitución FIFO*
    
    |------------------------+------+------+-----+-----+-----+----+----+----+----+----+----+----+----+-------|
    | Sec. Paginas de P1     |   10 |   11 |   0 |   3 |   4 | 11 |  0 |  3 |  4 | 11 |  0 |  3 |  4 | TOTAL |
    |------------------------+------+------+-----+-----+-----+----+----+----+----+----+----+----+----+-------|
    | Frame 1                |   10 |   10 |  10 |  10 | ~4~ |  4 |  4 |  4 |  4 |  4 |  4 |  4 |  4 |       |
    | Frame 2                |      |   11 |  11 |  11 |  11 | 11 | 11 | 11 | 11 | 11 | 11 | 11 | 11 |       |
    | Frame 3                |      |      |   0 |   0 |   0 |  0 |  0 |  0 |  0 |  0 |  0 |  0 |  0 |       |
    | Frame 4                |      |      |     |   3 |   3 |  3 |  3 |  3 |  3 |  3 |  3 |  3 |  3 |       |
    |------------------------+------+------+-----+-----+-----+----+----+----+----+----+----+----+----+-------|
    | TLB (pagina=1)         |   10 |   10 |  10 |  10 |   4 |  4 |  4 |  4 |  4 |  4 |  4 |  4 |  4 |       |
    | TLB (pagina=2)         |      |   11 |  11 |  11 |  11 | 11 | 11 | 11 | 11 | 11 | 11 | 11 | 11 |       |
    | TLB (pagina=3)         |      |      |   0 |   0 |   0 |  0 |  0 |  0 |  0 |  0 |  0 |  0 |  0 |       |
    | TLB (pagina=4)         |      |      |     |   3 |   3 |  3 |  3 |  3 |  3 |  3 |  3 |  3 |  3 |       |
    |------------------------+------+------+-----+-----+-----+----+----+----+----+----+----+----+----+-------|
    | Page Fault             |    1 |    1 |   1 |   1 |   1 |  0 |  0 |  0 |  0 |  0 |  0 |  0 |  0 |     5 |
    |------------------------+------+------+-----+-----+-----+----+----+----+----+----+----+----+----+-------|
    | Acceso a Disco         |    1 |    1 |   1 |   1 |   1 |  0 |  0 |  0 |  0 |  0 |  0 |  0 |  0 |     5 |
    |------------------------+------+------+-----+-----+-----+----+----+----+----+----+----+----+----+-------|
    | Operación de Lectura   | p=10 | p=11 | p=0 | p=3 | p=4 |    |    |    |    |    |    |    |    |       |
    |------------------------+------+------+-----+-----+-----+----+----+----+----+----+----+----+----+-------|
    | Operación de Escritura |      |      |     |     |     |    |    |    |    |    |    |    |    |       |
    |------------------------+------+------+-----+-----+-----+----+----+----+----+----+----+----+----+-------|
    | *Accesos TLB*          |    2 |    2 |   2 |   2 |   2 |  1 |  1 |  1 |  1 |  1 |  1 |  1 |  1 |    18 |
    |------------------------+------+------+-----+-----+-----+----+----+----+----+----+----+----+----+-------|
    | Accesos a Memoria      |    2 |    2 |   2 |   2 |   2 |    |    |    |    |    |    |    |    |    10 |
    |                        |      |      |     |     |     |    |    |    |    |    |    |    |    |       |
    |------------------------+------+------+-----+-----+-----+----+----+----+----+----+----+----+----+-------|
    #+TBLFM: @10$15=vsum($2..$14)::@11$15=vsum($2..$14)::@14$15=vsum($2..$14)::@15$15=vsum($2..$14)
*** Punto A - Proceso 2
    - La Tabla de Paginas (TP) de cada proceso usa el *algoritmo de sustitución LRU*
    - La TLB usa el *algoritmo de sustitución FIFO*

    |------------------------+------+------+------+------+------+------+------+------+------+-------|
    | Sec. Paginas de P2     |   10 |   11 |   12 |   13 |   14 |   15 |   16 |   17 |   18 | TOTAL |
    |------------------------+------+------+------+------+------+------+------+------+------+-------|
    | Frame 1                |   10 |   10 |   10 |   10 | ~14~ |   14 |   14 |   14 | ~18~ |       |
    | Frame 2                |      |   11 |   11 |   11 |   11 | ~15~ |   15 |   15 |   15 |       |
    | Frame 3                |      |      |   12 |   12 |   12 |   12 | ~16~ |   16 |   16 |       |
    | Frame 4                |      |      |      |   13 |   13 |   13 |   13 | ~17~ |   17 |       |
    |------------------------+------+------+------+------+------+------+------+------+------+-------|
    | TLB (pagina=1)         |   10 |   10 |   10 |   10 |   14 |   14 |   14 |   14 |   18 |       |
    | TLB (pagina=2)         |      |   11 |   11 |   11 |   11 |   15 |   15 |   15 |   15 |       |
    | TLB (pagina=3)         |      |      |   12 |   12 |   12 |   12 |   12 |   16 |   16 |       |
    | TLB (pagina=4)         |      |      |      |   13 |   13 |   13 |   13 |   17 |   17 |       |
    |------------------------+------+------+------+------+------+------+------+------+------+-------|
    | Page Fault             |    1 |    1 |    1 |    1 |    1 |    1 |    1 |    1 |    1 |     9 |
    |------------------------+------+------+------+------+------+------+------+------+------+-------|
    | Acceso a Disco         |    1 |    1 |    1 |    1 |    1 |    1 |    1 |    1 |    1 |     9 |
    |------------------------+------+------+------+------+------+------+------+------+------+-------|
    | Operacion de Lectura   | p=10 | p=11 | p=12 | p=13 | p=14 | p=15 | p=16 | p=17 | p=18 |       |
    |------------------------+------+------+------+------+------+------+------+------+------+-------|
    | Operacion de Escritura |      |      |      |      |      |      |      |      |      |       |
    |------------------------+------+------+------+------+------+------+------+------+------+-------|
    | Acceso a TLB           |    2 |    2 |    2 |    2 |    2 |    2 |    2 |    2 |    2 |    18 |
    |------------------------+------+------+------+------+------+------+------+------+------+-------|
    | Acceso a Memoria       |    2 |    2 |    2 |    2 |    2 |    2 |    2 |    2 |    2 |    18 |
    |------------------------+------+------+------+------+------+------+------+------+------+-------|
    #+TBLFM: @10$11=vsum($2..$10)::@11$11=vsum($2..$10)::@14$11=vsum($2..$10)::@15$11=vsum($2..$10)
